{
    "en": {
      "home": "Home",
      "about": "About",
      "services": "Services",
      "contact": "Contact",
      "welcome": "I'm",
      "name": "DAVID HURTADO",
      "career": "CONSULTANT & SOFTWARE ENGINEER",
      "aboutTitle": "ABOUT ME",
      "experienceTitle": "EXPERIENCE",
      "projectsTitle": "PROJECTS",
      "aboutContent": [
        "I'm a passionate <strong>Software Engineer</strong> with a strong foundation in full-stack development, specializing in <strong>Java, JavaScript, PHP, Python, and SQL</strong>. With a background in <strong>computer engineering</strong> and hands-on experience in <strong>web development, database management, and cloud computing</strong>, I thrive on building scalable and efficient software solutions.",
        "Throughout my career, I’ve worked on diverse projects, from designing <strong>user authentication systems</strong> to developing <strong>data-driven applications</strong>. My expertise extends to <strong>React.js, Bootstrap, and backend technologies</strong> that power modern web applications. I’m also skilled in <strong>AI model deployment and cloud infrastructure</strong>, having obtained multiple industry-recognized certifications.",
        "I’m always eager to tackle new challenges and push the boundaries of my technical skills. Whether it’s <strong>optimizing performance, learning new frameworks, or collaborating on innovative projects</strong>, I strive to deliver impactful solutions. As I continue to grow in the tech industry, my goal is to contribute to cutting-edge software that enhances user experiences and drives business success."
      ],
      "downloadCV": "Download CV",
      "projects": [
        {
          "title": "Klipperz Academy System",
          "imgSrc": "img/Klip_Academy.png",
          "altText": "Klipperz Academy",
          "description": "Class management system designed with XAMPP, PHP, HTML, CSS, and JavaScript. This system streamlines registration and enhances data security with secure user authentication.",
          "link": "https://github.com/davidhurtado2000/Klipperz-Academy-System"
        },
        {
          "title": "Downstream",
          "imgSrc": "img/Downstream.png",
          "altText": "Downstream",
          "description": "YouTube downloader built with Electron in collaboration with Weston Rivers (Student of theCoderSchool). It allows users to download videos. It uses libraries like FFmpeg and YouTube-dl for fast and reliable downloads.",
          "link": "https://github.com/StrataBytes/Downstream"
        },
        {
          "title": "Fact Checker Discord Bot",
          "imgSrc": "img/discord.png",
          "altText": "Fact Checker",
          "description": "A Discord bot that checks facts based on a given topic using a Wikipedia API. Made with Shiven Singh (Student of theCoderSchool).",
          "link": "https://github.com/ShivenSinghTheDeveloper/windows-bot-template-main"
        }
      ],
      "experiences": [
        {
          "period": "2022 - Present",
          "title": "Code Instructor - theCoderSchool Centennial",
          "description": "Conduct weekly, semi-private coding sessions for high school and college students, focusing on languages such as Python, JavaScript, Java, and C++. Students engage in a wide range of projects, including web development, chatbots, mobile applications, and game design. By collaborating with instructors nationwide, I stay updated with the latest teaching methods and technologies. My flexible teaching style adapts to student needs, continuously integrating new programming techniques.",
          "skills": ["React", "JavaScript", "PHP", "Python", "Lua", "C++", "C#", "HTML", "CSS", "Java", "SQL"]
        },
        {
          "period": "2023 - Present",
          "title": "Jr. Software Engineer - Klipperz Barbershop",
          "description": "I designed and implemented a class management system using XAMPP, PHP, HTML, CSS, and JavaScript, which significantly improved the academy's operational efficiency by streamlining registration and attendance tracking. By implementing secure user authentication, I enhanced data security. Collaborating with stakeholders, I gathered system requirements and delivered tailored solutions to improve class scheduling and administrative tasks.",
          "skills": ["PHP", "JavaScript", "HTML", "CSS", "Bootstrap", "SQL"]
        }
      ]
    },
    "es": {
      "home": "Inicio",
      "about": "Sobre mí",
      "services": "Servicios",
      "contact": "Contacto",
      "welcome": "Soy",
      "name": "DAVID HURTADO",
      "career": "CONSULTOR E INGENIERO DE SOFTWARE",
      "aboutTitle": "SOBRE MÍ",
      "experienceTitle": "EXPERIENCIA",
      "projectsTitle": "PROYECTOS",
      "aboutContent": [
        "Soy un <strong>Ingeniero de Software</strong> apasionado con una sólida formación en desarrollo full-stack, especializado en <strong>Java, JavaScript, PHP, Python y SQL</strong>. Con experiencia práctica en <strong>desarrollo web, gestión de bases de datos y computación en la nube</strong>, me enfoco en construir soluciones de software escalables y eficientes.",
        "A lo largo de mi carrera, he trabajado en diversos proyectos, desde el diseño de <strong>sistemas de autenticación de usuarios</strong> hasta el desarrollo de <strong>aplicaciones basadas en datos</strong>. Mi experiencia incluye <strong>React.js, Bootstrap y tecnologías backend</strong> que impulsan aplicaciones web modernas. También tengo habilidades en <strong>implementación de modelos de IA e infraestructura en la nube</strong>, con múltiples certificaciones reconocidas por la industria.",
        "Siempre estoy ansioso por enfrentar nuevos desafíos y superar los límites de mis habilidades técnicas. Ya sea <strong>optimizando el rendimiento, aprendiendo nuevos frameworks o colaborando en proyectos innovadores</strong>, me esfuerzo por ofrecer soluciones impactantes. Mi objetivo es contribuir al desarrollo de software de vanguardia que mejore la experiencia del usuario y impulse el éxito empresarial."
      ],
      "downloadCV": "Descargar CV",
      "projects": [
        {
          "title": "Sistema de Academia Klipperz",
          "imgSrc": "img/Klip_Academy.png",
          "altText": "Klipperz Academy",
          "description": "Sistema de gestión de clases diseñado con XAMPP, PHP, HTML, CSS y JavaScript. Este sistema agiliza el registro y mejora la seguridad de los datos con autenticación segura de usuarios.",
          "link": "https://github.com/davidhurtado2000/Klipperz-Academy-System"
        },
        {
          "title": "Downstream",
          "imgSrc": "img/Downstream.png",
          "altText": "Downstream",
          "description": "Descargador de YouTube construido con Electron en colaboración con Weston Rivers (Estudiante de theCoderSchool). Permite a los usuarios descargar videos. Utiliza bibliotecas como FFmpeg y YouTube-dl para descargas rápidas y confiables.",
          "link": "https://github.com/StrataBytes/Downstream"
        },
        {
          "title": "Bot de Discord Verificador de Hechos",
          "imgSrc": "img/discord.png",
          "altText": "Fact Checker",
          "description": "Un bot de Discord que verifica hechos basados en un tema dado utilizando una API de Wikipedia. Hecho con Shiven Singh (Estudiante de theCoderSchool).",
          "link": "https://github.com/ShivenSinghTheDeveloper/windows-bot-template-main"
        }
      ],
      "experiences": [
        {
          "period": "2022 - Presente",
          "title": "Instructor de Programación - theCoderSchool Centennial",
          "description": "Dirijo sesiones semanales de programación semiprivadas para estudiantes de secundaria y universidad, enfocándome en lenguajes como Python, JavaScript, Java y C++. Los estudiantes participan en una amplia gama de proyectos, incluyendo desarrollo web, chatbots, aplicaciones móviles y diseño de juegos. Colaborando con instructores a nivel nacional, me mantengo actualizado con los últimos métodos y tecnologías de enseñanza. Mi estilo de enseñanza flexible se adapta a las necesidades de los estudiantes, integrando continuamente nuevas técnicas de programación.",
          "skills": ["React", "JavaScript", "PHP", "Python", "Lua", "C++", "C#", "HTML", "CSS", "Java", "SQL"]
        },
        {
          "period": "2023 - Presente",
          "title": "Ingeniero de Software Jr. - Klipperz Barbershop",
          "description": "Diseñé e implementé un sistema de gestión de clases utilizando XAMPP, PHP, HTML, CSS y JavaScript, lo que mejoró significativamente la eficiencia operativa de la academia al agilizar el registro y el seguimiento de asistencia. Al implementar autenticación segura de usuarios, mejoré la seguridad de los datos. Colaborando con las partes interesadas, recopilé los requisitos del sistema y entregué soluciones personalizadas para mejorar la programación de clases y las tareas administrativas.",
          "skills": ["PHP", "JavaScript", "HTML", "CSS", "Bootstrap", "SQL"]
        }
      ]
    }
  }